app/controllers/comments_controller.rb

INSERT INTO "comments" ("commentable_id", "commentable_type", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @comment = @commentable.comments.new(params[:comment])
    if @comment.save