app/controllers/leads_controller.rb

  def index
    @leads = @leads = current_user.leads.all
---
SELECT "leads".* FROM "leads" WHERE "leads"."user_id" = 2

  def show
    @lead = Lead.find(params[:id])
---
SELECT "leads".* FROM "leads" WHERE "leads"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @lead = Lead.find(params[:id])
---
SELECT "leads".* FROM "leads" WHERE "leads"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @lead = current_user.leads.build(params[:lead])

    respond_to do |format|
      if @lead.save
---
INSERT INTO "leads" ("company_name", "contact", "created_at", "email", "notes", "phone", "updated_at", "user_id", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @lead = Lead.find(params[:id])

    respond_to do |format|
      if @lead.update_attributes(params[:lead])
---
SELECT "leads".* FROM "leads" WHERE "leads"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "leads" SET "website" = '1', "contact" = '1', "phone" = '1', "email" = '1', "notes" = '1', "updated_at" = '2013-04-06 02:36:26.930230' WHERE "leads"."id" = 5

  def destroy
    @lead = Lead.find(params[:id])
    @lead.destroy
---
SELECT "leads".* FROM "leads" WHERE "leads"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "leads" WHERE "leads"."id" = ?  [["id", 3]]